"""
Создать переменную содержащую сторону квадрата,
создать новый список, в котором будут периметр квадрата, площадь квадрата и диагональ квадрата.
"""
a = 3
new_list = []
perimeter = a * 4
square = a * a
diagonal = a * (2 * 0.5)
new_list = [perimeter, square, diagonal]
print(new_list)