"""
Создать три переменные, содержащие возраст трех ваших друзей,
в качестве имен переменных использовать имена друзей, найти сумму и вывести ее на экран.
"""
veronika = 22
alex = 34
leo = 25
ages_sum = veronika + alex + leo
print(ages_sum)

"""
Создать еще одну переменную равную среднему арифметическому возрасту, и вывести это значение на экран.
"""
average = (veronika + alex + leo) / 3
print(average)
