"""
Создать список состоящий из отдельных единичных символов,
преобразовать список в строку, инвертировать строку и вывести на печать.

"""
y = [2, 4, "k", 7]
y = "2, 4, 'k', 7"
y = y[::-1]
print(y)