"""
Вывести в порядке возрастания все простые числа,
расположенные между n и m (включая сами числа n и m), а также количество x этих чисел.
"""
n = int(input("Введите число n, (n < m): "))
m = int(input("Введите число m, (m > n): "))
my_list = []
for i in range(n, m):
    range(n, i-1)
    if i % j == 0:
        print(i)

# не работает